{
    "title": "Pathfinders",
    "date": "2026-01-03",
    "tags": ["evolution", "psychology", "philosophy", "free_will"],
    "thumb": "8b537705b6890b784749f6794fc10679",
    "content": [
        "The first rules in the universe, created by the pioneers, the basic intelligent structures, would be made out of chaos. Pure. Impulsive. Meaningless. Skipping a few million years, we design our rules using other rules. They have preceding rules, something that we call a \"reason\" to exist.",
        "It doesn't have to be a good reason, of course, but now we see this pattern everywhere. We notice that actions are performed for a reason and things are created or destroyed for a reason.",
        "Then we learn how to work with transitivity. You may have a distant goal and create something that will lead you to it. That something in the middle will have not only a reason to exist, but a new quality that we may call a \"purpose\".",
        "In some sense, purpose exists only within that triangle of transitivity. If you remove any part of it, the purpose vanishes automatically. This is why it's so hard to find it in life. Usually, there are missing parts of the equation.",
        "Our emotional self-diagnosing system utilizes information on the alignment of incoming data with already existing sequences in memory, in our [pattern-based internal worlds](/post/internal-world).",
        "This leads us to that weird feeling of unease when the pattern breaks. It's difficult to process that so many insignificant things around have their purposes and you suddenly don't.",
        "A substitute can be created. If you set a goal, then you may treat yourself today as a creator with some reason in mind, and yourself tomorrow as someone who will have a purpose. This self-creation, a personal \"calling\", replaces the missing triangle, fixes the broken pattern, and provides peace of mind.",
        "But how do you choose a goal? It's not a problem to be solved by pure reasoning, is it? Without any grand purpose, you'll have to make a free choice, one way or another.",
        "If you prefer to fill the hole in your heart, to get a purpose, you'll have to embrace the chaos once again. We aren't that different from the pioneers. Fire will show you the path, but you have to step into the darkness to dance with shadows.",
        "Advanced self-preservation mechanisms will vote against that game, poisoning our minds with existential fear of freedom, pushing all of us into the patterns of behavior (10) and (16).",
        "Some get stuck in there, avoiding changes, collecting fears, accepting guidance and protection, even from imaginary beings. But it's not the only way. There are other patterns to choose from. You can create your own path. Just don't forget the lighter."
    ]
}
