{
    "title": "Bait-therapy",
    "date": "2026-02-02",
    "tags": ["evolution", "psychology", "emotions"],
    "thumb": "7b5ca22228a08d2677d5431c7d7b120f",
    "content": [
        "When we deal with emotions, or, better to say, with different states of the system, we inevitably understand that some of them are [temporary by design](/post/fear). They can't last.",
        "This opens a door into a field of interventions that we may call bait-therapies. We incite the system, trigger some active response, and wait until it ends. After that, there is a gap, a period of time when the same response can't be reactivated.",
        "That gap can be abused in various ways. You let a person cry a river, until one can't cry no more, and then you talk. Or you make a ritual doll that represents somebody, cut its eyes, rip its head off, and throw it into a fire. Yes, it brings peace.",
        "The person gets into a position where cold-blooded logic is the only thing that works, because everything else is either recharging or waiting for other kinds of maintenance. This is when you may suggest something and make a discussion.",
        "Some psychological approaches, like gestalt-therapy or art-therapy, use this trick when [working with traumas](/post/trauma). You allow patients to live within a simulation, talk to an empty chair or draw an imaginary world, and experience various extreme states of their psyche. After that, they get a relief of sorts and learn something. We may see that as a successful session.",
        "However, this trick doesn't solve any problems. It just allows you to exaggerate a part of your patterns of behavior without interacting with real everyday environments. It's not enough.",
        "The pattern repeats. It's a loop. Fish bites the same bait again and again. You can stay in therapy for years with zero progress, just replaying the same situation over and over.",
        "If you want to get out, you have to do stuff. Not just live through your emotions. It's a meaningless goal. They'll get back at the next iteration of the loop anyway.",
        "Break a pattern. Choose another one. Get a new set of values. Build a new life. The bait will become irrelevant at some point. You don't hide or deny it. No. You just don't get triggered anymore. You have other priorities now.",
        "This exit from therapy should be obvious, and yet I see tons of examples where people don't get there. Changes that they get from their therapy don't last. They get back with a new disturbing story that looks almost like the one before.",
        "Your job as a therapist isn't baiting. Make sure that your client is changing and not just getting that temporary peace of mind. That apparent stability is a bait for you."
    ]
}
