{
    "title": "Good, bad, traditional",
    "date": "2026-01-18",
    "tags": ["evolution", "philosophy"],
    "thumb": "fcd4a717ffbe5b06aeebe05156788106",
    "content": [
        "As intelligent beings, we create lots of rules to guide our behavior. We have to stick to the standard set of patterns to avoid [unresolvable logical conflicts](/post/unresolvable-conflict), but we're free to make local choices and fine-tune the patterns to our taste.",
        "We're smart enough to create rules with a [purpose](/post/pathfinders). They're not just rules for the sake of rules. We create them to achieve something. We don't like spending our precious resources on following rules that don't lead to any rewards at all, do we?",
        "Is some rule a good one or a bad one? Look at your goals. If the rule helps you to achieve them, then it's a good one. If it doesn't, then it's a bad one. No need to complicate this.",
        "In some cases, we can compare resources required to achieve our goals in different scenarios and find the best rule, the most efficient among the good ones.",
        "Everything looks well-organized at first, but then we start to forget things. How many rules in the core of our society still have clear purposes? How many rules lost them completely?",
        "A significant amount of the collective rules are in use not because they actually lead us to something valuable. People follow them to get formal appreciation or avoid condemnation from their ancestors who have the same motivations to follow them. These aren't your standard rules anymore, but \"traditions\".",
        "They don't have any purpose. It's quite the opposite. They emerge when we forget our initial goals. We repeat actions as usual, like there is some meaning behind them... Was. There was a meaning. We lost it, actually. But there was one. All our rules are important. Don't ask stupid questions!",
        "Goal-oriented rules get outdated, but traditions are timeless, and, as any other rules that we follow for a while, they become a part of who we are. They shape family things, subcultures, professional, religious, and national identities.",
        "Our self-preservation mechanisms inevitably start to preserve these social constructions. Yes, we waste resources, but usually it's safer to avoid changes, rather than playing with the fire of the unknown. However, the world doesn't stand still. Collective identities based on long forgotten goals always lose synchronization with reality. It's just a matter of time.",
        "This leads us to a choice. Preservation or change. We either keep pushing traditional options, or clarify our goals, discard the orphaned rules, keep the good ones, and fearlessly proceed with evolution.",
        "What will you choose?"
    ]
}
