{
    "title": "Make a choice",
    "date": "2025-09-02",
    "tags": ["evolution", "psychology", "philosophy", "free_will"],
    "thumb": "eadeb6a6576911c25b0316240b0ff113",
    "content": [
        "We portray our pagan ancestors in folklore as free and prideful men, standing against nature itself and playing with forces far beyond their control. They never kneel. They would better die fighting, rather than accept and obey. They value creativity. They're playing against all odds. They constantly transform themselves and the world. This path of change is dangerous. They pay with blood. But they are free.",
        "In this context, we may treat freedom and change as almost equivalent things. You don't break free when you choose between the provided options and then argue about things that you could have done otherwise. You need to change the rules of the game. Create a new option that was never given to you. Don't choose the future. Make it.",
        "These decisions may look very personal, because you may associate yourself with your memory, and data from it is being used, but they have to include some things that can't come from the same memory. You need a mutation to happen in your data.",
        "Depending on how you see yourself, they may look truly yours, or not. Many philosophers are flying in circles around the definition of \"you\" in this equation. As far as I can see, the answer depends on religions and historically affected cultural environments. But regardless of determinism, indeterminism, immaterial souls, or whatever stories you like, the problem reduces to memory and mutations in it.",
        "If you aim to change your life, you have to let go. Both your past memories and active control. Get all your demons together and cut them loose. Allow chaos to provide you alternative options. Take one that is more or less aligned with the data in your mindset and use it. Just because you can.",
        "Losing control? It's dangerous! No. No. No. Your will to live goes against your will to freedom. It's stupid. It's anarchy. It's inappropriate. Destroy stability? Take risks? Change everything? Seriously? Don't know what kind of witch made you think that it's a good idea, but we have to get rid of her. Your self-preservation mechanism protects you from changes.",
        "On the level of societies, we see the same picture. Will to live is being constructed in the form of police, courts, prisons, censorship, etc. It protects the existence of society. But the price is freedom.",
        "These days many people see freedom not in changes, not in rebellions, but in choosing which TV channel to watch. Some even say they don't have a choice. Maybe you need to remind yourself that you don't choose a choice.",
        "You make a choice."
    ]
}
