{
    "title": "The Devil's game",
    "date": "2025-08-15",
    "tags": ["evolution", "philosophy", "free_will"],
    "thumb": "c6135b5dc04911cce97a6d4793b5f526",
    "content": [
        "When we work with data, we don't really think about hardware. In most cases it's absolutely unnecessary. It doesn't matter what kind of materials and processes are present in your computer, as long as it works.",
        "However, if we put a computer into the environment with high radiation, random events start to happen. You could say that one destroyed molecule in the processor will not affect the program. Most likely not. But if we wait long enough, we get to the point where small destructions accumulate and start to affect the system as a whole. It either stops working completely, or some glitches appear in the program, or in the memory, where the program saves data.",
        "From the perspective of a program, this is a natural chaos that may or may not damage the system at any given moment. Of course, we can play with statistics. We can say that technically all these small particles and collisions are completely predetermined, but it doesn't matter. The robot knows that it is destined to go into that room with a melted reactor, but only a chance decides if the program will or will not work as expected.",
        "Even if God doesn't play dice on the level of atoms, the robot still has to play the Devil's game on the level of programs and data.",
        "When we talk about determinism in behavior, we often limit the path by the genes and the environment - education, family, friends, etc. We often say that some person is destined to end up in some place because all these factors are pushing him there.",
        "But all these initial constants and environmental factors exist on the level of software. Our sensors don't see what's going on at the lower levels. Things happen, but we don't save them in our memory for further use in the process of decision-making. Some of these hidden events can provide unpredictable alternative options to consider.",
        "It's funny to observe people talking about fate and destiny when they apply these concepts to individuals who actually choose these random options. They look at your past. They see the causes for everything. They predict your future. But the next day they have to change their tune and say that actually everything leads you to something completely different. And the next day it's something different again. And again, and again, and again.",
        "I think that we should differentiate the physical determinism and the practical unpredictability of behavior. Past events in our memory are not everything. There is some degree of randomness that exists on its own and may affect our decisions.",
        "What would you prefer, to stay where you are, correct the errors, discard deviating thoughts, and proceed with your life in an orderly fashion, or to embrace the chaos, play a game of chance, and build a different future?",
        "The choice is yours."
    ]
}
