{
    "title": "Selected to be sick",
    "date": "2025-11-06",
    "tags": ["evolution", "methodology"],
    "thumb": "75b3b7c0596abe96ef00ed0bc8badfa9",
    "content": [
        "Recently, I witnessed an interesting discussion about natural selection. The vast majority of participants supported an idea that depression provides benefits to our species. We were selected to be able to have it from time to time.",
        "The main argument was that an organism in depression saves energy and reduces risks by not participating in dangerous endeavors and interactions. It's a simple survival strategy.",
        "There are bits of evidence that support that story. It seems convincing. However, if we interpret it [from the perspective of my work](/evolutionary-theory-of-behavior/), we may come to a different conclusion.",
        "Complexity of systems increases with time. Combinations. Mutations. You know the drill. It's a long process. We get our 16 patterns of behavior eventually. We can do various things and can work efficiently in different circumstances.",
        "Flexibility of behavior may or may not be beneficial on its own, but it becomes extremely important when we build the next levels of complexity. Groups. Societies. Civilization. We need all our patterns of behavior to construct the world we know.",
        "There is an issue, or course. Sophisticated system of patterns requires switches. Small and fragile. They can be destroyed by force. They can get stuck or start to wobble. This is where we get a variety of malfunctions, depression included.",
        "Psychiatric diseases are inevitable at our level. We weren't selected to have one disease or another because it's cool to be sick. We just became too complex to avoid them.",
        "Species with simple designs, with one pattern to follow, if any, would be immune to depression. No switches. No problems. However, their civilization will require symbiotic connections between many species with different default patterns.",
        "Technically, it should be possible, but these species will have to share their communication protocols and synchronize their long-term goals. It's a tricky task, especially for biological systems that depend on random mutations in their evolution. Chances won't be in their favor.",
        "I think we should be careful when speculating about natural selection and the benefits of having diseases. It's easy to convince ourselves of something because it sounds good, but completely miss the engineering aspects of that phenomenon.",
        "It's much more interesting to design different species from scratch and see all the technical limitations. It becomes obvious that sometimes systems are vulnerable by design."
    ]
}
