{
    "title": "Scattered morality",
    "date": "2025-07-10",
    "tags": ["evolution", "psychology", "philosophy", "morality"],
    "thumb": "da3e17d4daa664da7f3753d9aa637079",
    "content": [
        "Values. Virtues. Priorities. Morality. Where do all these things come from? Looking from the perspective of the evolutionary theory of behavior, we expect to see two kinds of values: personal and collective.",
        "Personal values come from the patterns of behavior. If something supports the pattern, it is good. If something stops the pattern, it is bad.",
        "We expect to see a unique set of personal values for every pattern of the class I. Some of them can be combined within the patterns of the class II. Some of them contradict each other in diseases. These personal values change when the individual switches to another pattern of behavior.",
        "This kind of evaluation, what's good or bad, does not require any intelligence to be used. It comes from the alignment of the upcoming events with the patterns. No rules to create here. Little kids and animals seem to use this kind of values. They don't need to be taught what's important. They already know. This is the most primal kind of judgement. The inevitable one.",
        "Collective morality is different. It is a set of created rules. We need intelligence to create and follow the rules. Those little kids and most animals will have problems with them.",
        "Created rules are not connected to the fixed patterns of behavior anymore. We expect to see the variety of them being invented, changed, and discarded through history. Naturally, different social groups will have different sets of created and shared rules.",
        "There is no such thing as universal objective morality. Personal values from one pattern will inevitably contradict the values from some other patterns. Created rules will follow the interests of different individuals and groups, and will contradict the rules created by their neighbours.",
        "There are ways to balance the collective interests to some degree. However, the personal pattern-based values are fixed. The only way to change them is by switching patterns. But we cannot make all men use just one pattern for a long period of time. We need different patterns to sustain and develop civilization. This is the curse that humanity has to deal with. And all those theoretical alien civilizations will have the same problem as well. Actually, this can be a sad solution to the Fermi paradox. We are all doomed to never work together efficiently. And to colonize the universe we have to do that."
    ]
}
