{
    "title": "Fear",
    "date": "2025-08-14",
    "tags": ["evolution", "psychology", "emotions"],
    "thumb": "84322a33ebd4f7b2517936dc57be6532",
    "content": [
        "You're a little animal. You sit in your forest. It's a warm summer evening. You have your family with you, some food, and a comfortable shelter. Everything is fine. The sun goes down. It's time to sleep. You close your eyes and disappear... No. The forest is way too calm. Something is off. You start to look around. Nothing. Subtle smell of flowers, some fireflies are dancing around. Home, sweet home. You close your eyes. No. No. No. There is a shadow between the trees. Wait. Where is it? Oh, there is another one! You start to see the eyes gazing at you from the darkness. The bugs crawl under your skin. You feel how somebody touches you from behind. You cannot move. You're frozen. The evil poisoned your mind. The primal dread became your second shadow. You cannot fight it. It's in your head. You cannot run away. It's inside you. Some old legends say the fear can kill you. This is it. The end. The only thing you can do is to sit and wait for the inevitable.",
        "Psychologists tend to use the term \"fear\" loosely. We often mix completely different things using this word, losing the context, and making therapy less effective. I think that we should be more careful. There are several flavors of fear.",
        "The first one is a part of the fight-or-flight response, or whatever you call it these days. The bear attacks. You have to do something. Your body prepares for action. It's an immediate reaction that takes a lot of energy. It will not last forever. You need to stop and eat from time to time. Get yourself refueled. In some sense, this reaction is universal for every species and every pattern of behavior. We all have it one way or another. It just looks slightly different, depending on the body design and biases towards proactive or reactive behavior.",
        "The second type of fear is that dread that makes you stuck. It makes you paranoid without any visible reason. You cannot do anything. Your body doesn't work at all. This fear can last. It doesn't require much energy. It just keeps you alert all night long. In my theory, this sort of fear is deeply interconnected with specific patterns of behavior. Adult apex predators cannot get this reaction at all. It just doesn't fit in their patterns.",
        "The third type of fear is the rules-based one. It requires intelligence. If you create and follow the rules, then you can acquire a set of rules that makes you avoid something. If you pierce your throat with a fish bone, you'll probably make a rule to avoid that kind of fish in the future. This is different from the first two kinds of fear. It's in your memory. You can make hundreds and thousands of rules for all sorts of subjects and life scenarios. They don't require any energy to be kept in memory, and they can stay with you forever."
    ]
}
