{
    "title": "The architect's mindset",
    "date": "2025-06-28",
    "tags": ["evolution", "philosophy", "free_will", "methodology"],
    "thumb": "e417661de1e956270ec6980fbb2b85d8",
    "content": [
        "Let's imagine we're architects. We have a task to design a machine, a replicant, that will mimic human behavior. Or some animal. Let's say we have a \"free will\" module. We can plug it into the replicant. But. What is the functional role of this module?",
        "The average answer to this question in my environment is that this module gives the replicant the ability to rebel. To give a finger. To go outside the path that was prepared for him. Burn the bridges. Do things in his own way. If you provide him a 50/50 choice to press a left or right button, he will give you a finger and he will not press any of them. Without this module, he will be a robotic slave, repeating the same instructions over and over. Following the master's orders. With it, the replicant will always have the alternative options to consider in his decision-making unit.",
        "To perform its role, the module has to be connected to the memory mechanism. It is supposed to extend or override the saved instructions, how to behave, with something outside of that memory.",
        "First, this means that the \"free will\" module can work only with the systems of specific complexity. You need a memory mechanism to be present and filled with instructions. At least a read-only memory. Atoms don't have it. Stars don't have it. Human has. Dog has. Replicant will have.",
        "Second, the \"free will\" module, by its design, leads to the alternative contradictory processes inside the replicant. They will be destructive either to his memory, or some other parts, including the complete self-destruction, or to his environment. The additional self-preservation module will help to balance things out in the long run. Also, this \"free will\" module is not the one that will make the replicant follow the same rules for a long period of time. Including the moral rules. We will have to add another module for that.",
        "From the perspective of the architects, it doesn't really matter how exactly this module will work inside, as long as it fulfills its functional role. We can put the true randomness inside. It can be some determined but unpredictable system. It can be an antenna that receives a stream of data from the other side of the universe. Engineers will provide us options. As long as this mechanism is not being controlled directly from the memory of the replicant, it will work. It will make the replicant rebel.",
        "The point of this passage is not to talk about the free will specifically, but to point a finger at the mindset that seems to be lacking in the western field of philosophy. Think like an architect. Think about systems. Modules. Functional roles. Connections. Use cases. Generalized patterns. This is the way to see the big picture, even if you don't possess the final engineering details. This mindset helps to bring different concepts together and to guide the further research, instead of producing all these endless debates that don't lead to any new information whatsoever."
    ]
}
