{
    "title": "Personality traits",
    "date": "2025-08-25",
    "tags": ["evolution", "psychology"],
    "thumb": "eebfe917385e11e4e3de39306fcc5875",
    "content": [
        "One of the interesting topics for exploration is connections between personality traits and patterns of behavior. Are they even connected? And, if yes, then how?",
        "These sorts of data mappings are useful in practice, but I think we have to be careful. All these traits don't define you. They describe you. There is a difference. We assign the words to different observable qualities, but they don't necessarily explain the internal structure of the organism. I will propose a classification that can be used with my theory, but again, it's all about semantics and language.",
        "The first group of traits comes directly from our 16 patterns of behavior of the class I. When you use the same pattern over a long period of time, people start to associate its parts with you. Creative. Aggressive. Dramatic. These kinds of words describe what you do. They portray your patterns of behavior and should be bound together by the same logic as the basic impulses. We easily apply these words to little kids and our pet animals, since the patterns are universal.",
        "The second group is about your stability and efficiency. Cool-headed. Purposeful. Committed. Emotional. All over the place. These words don't describe any specific patterns, but provide data on your ability to actually finish whatever you do. Get the job done and not waste the resources. These qualities are very important in competitive environments, where the resources are limited. They're often mentioned in traditional martial arts as something crucial for survival and deeply interconnected with a state of a body. There are some correlations to study in their context.",
        "The third group includes the rules-based qualities. Idealistic. Principled. Methodical. Pedantic. In some cases they affect your efficiency, in some cases they don't, but what makes them special is that you need to be intelligent and create a lot of rules in your memory to get these traits associated with you. Cultural environment. Education. Previous experience. More rules you learn, more variety you get here. Usually we treat little kids and animals as intellectually inferior creatures and do not apply these words to them in any form.",
        "The fourth group includes the traits based on your connections with others. They don't describe you in vacuum, but rather add some data on the alignment of your behavior with a group. Selfless. Selfish. Reliable. Unreliable. Cooperative. Uncooperative. These words naturally come in pairs, and they're relative by definition. We're talking about combinations of compatible and incompatible patterns and rules that meet each other for various reasons and do not depend exclusively on your own personality. If you have multiple groups to interact with, then it's very possible that they'll associate the exact opposite traits of this kind with you. And usually we don't apply these words to animals, unless they're seriously involved in our group activities, like hunting dogs.",
        "What do you do? How stable are you? Any special rules? Answers to these questions describe your overall personality. I'm not sure if we should treat the fourth group of words as personality traits, but they can add more details to the description. Context can be important sometimes."
    ]
}
