{
    "title": "Relative irrationality",
    "date": "2025-08-22",
    "tags": ["evolution", "psychology", "morality"],
    "thumb": "49eb322fd06dd97d5a9eb8c8f9a81d3f",
    "content": [
        "Irrational. I avoided this word for a while. It's way too confusing. With a dream to build a replicant that will mimic human behavior, I'm looking for engineering explanations for everything, but irrational thinking is something odd. What is it? How do you build it? Nobody has any blueprints of it. I started to scroll through examples of irrational thoughts and actions with a hope to find some patterns in this mess on my own...",
        "Constant fear of safety. Perceiving every environment as dangerous. Choices to not do anything and procrastination. Consuming instead of creating. Ignoring. Crying for help when not needed... Wait. No. This looks like the processes on the reactive side of the table. These are patterns of behavior of the prey animals. They don't make any sense for a predator.",
        "Eventually I got some reversed examples, where the predatory behavior was claimed to be irrational from the perspective of the prey. That's an interesting duality of opinions. Almost like we have two opposing kinds of reasoning, and everybody believes that his reasoning is the rational one.",
        "It looks like this whole thing is not about you choosing emotions over brains, but about somebody wanting you to be a predator, while you're not one of them, or vice versa.",
        "This means that the term \"irrational\" is relative, actually. You're always rational in relation to your own patterns of behavior, but at the same time you can be irrational in relation to the patterns on the other side. In many ways it's like a [personal morality](/post/scattered-morality). It's not universal by definition.",
        "In mania, depression, catatonia, and schizophrenia, we see combinations of contradicting patterns inside one individual. The behavior goes against itself. These are real conflicts in logic. Most people who are blamed to be irrational do not have anything like that. They're not sick in any way. They just happen to be in the wrong place at the wrong time and are being confronted with some expectations.",
        "Sometimes healthy people may want to switch to other kinds of behavior for some reason. We can help them, but we have to keep in mind that this is not about some minor thoughts. The chemistry of the whole organism will be affected. New behavior will seriously contradict the existing one.",
        "We expect to see the withdrawal symptoms during the switch. The relationships in the groups will be destroyed. You cannot change a side for real and pretend that nothing happened. It's not just dreams. There will be consequences. You have to burn your old life to build a new one. Not every person out there will be ready to pay the price. It will look like an irrational thing to do."
    ]
}
