{
    "title": "Compensation",
    "date": "2025-09-04",
    "tags": ["evolution", "psychology"],
    "thumb": "b9c9cec640bef57eab2f394c20259849",
    "content": [
        "Life is a game of incomplete information. We make decisions using the data we have. We approximate our future all the time. And this process heavily depends on our knowledge.",
        "In math, it's highly unlikely that you'll guess the curve looking at one point. Even two of three points will leave you clueless. With ten points your guesses become more precise. You still can fail spectacularly, even with hundreds of them, but more points increase the chances of making the right guess.",
        "The same happens in life. You imagine something using a limited set of data. Then you learn more and realize your... It's not a mistake. No. Let's call it \"unlucky guess\". You can miss just a bit, or get something completely opposite to reality.",
        "You're intelligent. Any guess, any choice, leads to the creation of new rules. You continue to add more data to the graph of memories using these rules. Your whole personality shifts somewhere. It's our nature. We constantly change.",
        "If some choice affects a lot of things in your life, the accidental shift can be dramatic. Some would see it as a compensation. Like you got a small problem and decided to run from it in the opposite direction. However, I would argue that this is not a defense. It's just a premature guess that leads to unplanned big changes. A butterfly effect, if you will.",
        "Psychologists often talk about healthy and unhealthy compensations. This evaluation relies on the environment and collective morality, but everything [is relative](/post/relative-irrationality). Prey could easily say that predatory behavior is a bad compensation for some insecurities. Don't forget that our closest cousins in the wilderness eat raw meat. We were never designed to be wimps by default. Different patterns of behavior have reasons to exist, even if they look bad to your eyes. Biology and subjective morality are not the same. Don't rush your verdicts about the healthiness of changes.",
        "Personality shifts are harmless on their own. However, dissonances in data are expected to appear when you learn more things after a big turn. Your brain will have to fix them, remove some rules and tune some numbers to compensate for over or under estimations. It takes time, but it's a [natural process](/post/make-it-black) of data invalidation. Nothing to worry about.",
        "But if you get a disease that allows contradicting patterns of behavior to appear, any shift may become a problem. Your brain will not delete data if it's being actively used. If you have two conflicting processes that utilize incompatible pieces of information, the dissonance may stay there until you resolve the logical conflicts and keep just one process running.",
        "Fixing the primary disease should be a top priority. Otherwise, you'll have a constant memory of living somebody else's life."
    ]
}
