{
    "title": "And how does that make you feel?",
    "date": "2025-07-15",
    "tags": ["evolution", "psychology", "emotions"],
    "thumb": "af3023a3ea2106e2a3bca984cffce4c8",
    "content": [
        "The central part of my theory of behavior, the mechanism that connects the basic impulses, is a finite-state machine.",
        "We can add some time modifiers for the basic impulses. Long ago. Last time. Real time. Expected in the future. Something like that. We can add the diagnostic flags for the current or recently finished processes. Are they ok, or are there any problems? Also, we can add some system notifications for wounds, gaining or losing resources, memory malfunctions, etc.",
        "This will lead us to the machine with a few hundred possible states. It's not that much, actually, in the IT world we deal with much more complex machines. But in a biological context, it's not just data. Every state may have a corresponding feeling to it. Emotion, as some might say.",
        "The emotions that come from the diagnostic data are universal. They do not depend on the patterns of behavior. Both predators and prey can have them. And they change all the time, following the events.",
        "However, some emotions are exclusive to different patterns. Prey will never feel the pleasant anticipation of supremacy when you're preparing to taste the fresh blood of your opponent. It's a purely predatory thing to feel.",
        "Unfortunately, we don't have the names for all the states of this machine. For all emotions. This makes the research difficult. It's exactly the situation where the language determines thought. Without the words, it may feel like there is nothing to explore there. There is something.",
        "If we assume that these feelings are a signalling system that helps to coordinate the activities inside the individual, or to coordinate the actions with the neighbours, then the question arises: how do you control them? Is it even possible? Or maybe this control is just some useless wordplay, because technically the emotion is just the description of the state of the machine?",
        "In the field of psychology, the control of emotions is a popular thing to discuss. However, I always felt like there was something off about it. The only way to really change emotions is by changing behavior. If your behavior is the same, you'll get back to the same combinations of emotions over and over, no matter how hard you're trying to control them."
    ]
}
