{
    "title": "Rigged democracy",
    "date": "2025-12-27",
    "tags": ["evolution", "politics"],
    "thumb": "d07d64231197f8c07d3e1d1eee66e14c",
    "pinned": "true",
    "content": [
        "If we take a group of people and make them vote for a single leader, what [pattern of behavior](/evolutionary-theory-of-behavior) would they choose? Is this election even fair, or is the winner always predetermined?",
        "Let's be honest. Would you like a lazy customer (11+14) to be the president? I doubt that he would work hard for society. Adaptive victim (9+15) perhaps? Let's ignore problems and cry together! No? Maybe we should try something more proactive? Obsessed gladiator (2+5) is an excellent choice. We haven't seen enough guillotines on the streets recently. No again? Interesting.",
        "Following your logic, we'll discard helpless conformists (10+16) for being full of fear and incapable of ruling, fools (13) for wasting resources, invisible prisoners (1+7) for bringing uncontrollable aggression, genius philosophers (3+8) for following forbidden desires and provocations...",
        "Wait, wait, wait. You lead us to a bizarre conclusion. Out of 16 patterns, only three seem to be more or less acceptable to the majority. Artist (6), recidivist (4), and apologetic one (12).",
        "And they're not equal yet. Artist requires an environment that will ignore him. We can find examples of local governors who create beautiful places to live out of small towns in the middle of nowhere, but the moment we get into big politics with its publicity and pressure, this choice practically disappears.",
        "This leaves us with two candidates. Recidivist destroys things to protect something. Apologetic one mirrors that, and invests in reconstruction. And they can succeed each other in a cycle.",
        "Dangerous events happen. People need protection and vote for a recidivist. His precise destruction is welcomed at first, but he can't stop. People get frustrated and choose the opposite. Something bad happens eventually, and history repeats itself.",
        "Naturally, two mirrored patterns create the same conflict of logic that we see in schizophrenia. Executive organs that try to cheat and use them simultaneously always work awkwardly.",
        "Since recidivist is the only proactive pattern in the pair, we expect to see more annoying marketing from that side. Have you noticed how these guys on TV constantly talk about protecting you from something that you never saw? It's not a coincidence.",
        "To put the final nail in the coffin, none of the patterns in the last column of our table, including these two, utilize long-term memory. If you feel like the chosen politicians have a memory of a goldfish, they do. This is how patterns work.",
        "Democracy. What can I say? Does it really depend on your vote?"
    ]
}
