{
    "title": "Make it black",
    "date": "2025-08-04",
    "tags": ["evolution", "psychology", "memory"],
    "thumb": "e2740ef71cddebd7004f31984dca3bf7",
    "content": [
        "One of the things that can happen in the graph of memories is cognitive dissonance. Memories just don't match each other or some data that comes from the inputs of the system.",
        "It's not necessarily a bad thing. It happens all the time in every system that interacts with its environment. It changes. Data has to be updated. It takes some time. Meanwhile, some types of bugs can appear in the system. In human terms, you'll feel a bit confused.",
        "The brain should be able to update the memory graph and remove the conflicts. In dissociative disorders we get lots of wrong connections simultaneously, and the process of recovery becomes tricky, even impossible in some cases, but if you're healthy, then you have nothing to worry about. This dissonance is a temporary inconvenience.",
        "During traumatic events, you can get a serious dissonance. If you had a person who've been with you for your whole life, that person should be connected to a lot of things in the memory graph. If you lose him, it would take a lot of time to fix the connections. To make them match the world outside. It can become annoying at some point. Usually people start to notice the dissonances only in these harsh circumstances.",
        "Technically, humor is a way to create small dissonances in controllable conditions. There are fifty shades of humor. The black one is the closest to the things that psychologists may perceive as traumas. But the joke is tiny. It doesn't hit any deep connections in the graph. The brain quickly adapts to the dissonance. It's not disturbing.",
        "In some sense, black humor is like a vaccine. You get a minor feeling of dissonance in the context of traumatic events. You get comfortable with it. When the time comes, you don't feel too confused. It's not about positive emotions and laughing, but about your ability to sit tight while your brain is working hard to fix the outdated connections in the memory.",
        "It seems like this is not a very popular opinion in psychological circles, but maybe we should be less serious. And this relates to the academic community as well. Professionals often stick to old theories. It's hard to make a discussion. It's hard to bring new approaches. They feel too confused. Too anxious. Lost. It becomes much easier if you draw the horns on the portrait of grandpa Freud on that wall and ask some silly questions from time to time.",
        "Make a cup of humor every morning. Make it black. Enjoy it. Open the window. Let the sweet smell of exhaust gases with a fresh note of garbage accompany the beautiful melody of your neighbour's drill. The world can wait."
    ]
}
