{
    "title": "Intellectualization",
    "date": "2025-09-09",
    "tags": ["evolution", "psychology", "emotions"],
    "thumb": "f001cf3d6a8ce7498dfc8a9f1a2a4c6a",
    "pinned": "true",
    "content": [
        "Emotions are a [signaling part](/post/and-how-does-that-make-you-feel) of the self-diagnosing system. Normally, you connect it to the decision-making unit and pass data to it. If that unit doesn't use this data, some will call it an intellectualization. It's like a defense, but the symptoms aren't specific. The causes can be different.",
        "First situation. Your system works fine, but your resources are limited. You need to be efficient. In this case, you may play with priorities and mark some data as not important.",
        "This is what they teach you to do in traditional martial arts. You're aware of your status, but you don't use that data to make decisions at the moment. Good news or bad ones. It doesn't matter. Keep the balance. You need intelligence here.",
        "Second situation. You got an overamplified signal in the system. It can easily fry your decision-making unit. Your fuses stop it automatically. No intelligence. Just a fuse.",
        "You lose all data from some part of your system. It's not because you created a logical rule to ignore it, but because your safety system got triggered. Your data can still be there, but you can't get to it until your fuses reset. You may measure tension in the system and feel isolated in some sense.",
        "Third situation. Your system lost energy. This is what we expect to see in schizophrenia, when the completely opposite processes annihilate each other and constantly waste energy.",
        "You have to cut power in some places. Self-monitoring system is optional, so you can safely shut it down and keep the main system running. Your fuses are intact. You don't have any rules to ignore data. You just don't have any data for now.",
        "Interestingly enough, sick people, who understand that some system doesn't work and adapt their rules in advance, can be suspiciously stable in catastrophic environments. Everybody around is getting overloaded and confused and they don't.",
        "Also, there is a fourth scenario, where the physical damage to data channels prevents you from using information. It's a whole new level of problems, but it gives us similar results.",
        "These situations look almost identical from the outside. You use your upper brain and you don't get unbalanced by data of the specific type. It's easy to accidentally see them as one.",
        "Next time you blame somebody for being not emotional enough, pay attention to details. Not every person is identical, and the most popular second scenario for intellectualization doesn't require intelligence at all. Keep that in mind."
    ]
}
