{
    "title": "Field of prey",
    "date": "2025-12-16",
    "tags": ["evolution", "psychology"],
    "thumb": "6ddfa5f65539186941b18014bb12b46c",
    "content": [
        "Take a chimp who just ripped an arm from some small monkey, passed it with a smile to his brother to enjoy a lunch together, and tell him that they became so violent because their mother didn't like them enough.",
        "They'll laugh at you and suggest that you try a leg. They're designed to be predators! It's natural for them. But if so, at what exact moment of evolution did we get an idea that we're not designed to behave like they do?",
        "Or is it \"not supposed\"?",
        "Do we have to suppress our nature to make some snowflakes feel comfortable? This question isn't only about bloody aggression. There are lots of things to do on that side, but psychology as a field becomes focused on repressing or ignoring proactive predators and supporting reactive behavior, suitable for prey.",
        "As a therapist, you may not see that bias as a problem. It's understandable. You work with [traumatized](/post/trauma) people. All of your clients happen to use reactive patterns of behavior.",
        "Your tools and tricks have to work with prey, but not with predators. They'll never go to therapy anyway, unless they end up in some asylum for the criminally insane. Hopeless cases, aren't they? What a shame!",
        "Average therapists see the same reactive patterns of behavior (9) and (15) all the time, separately or within patterns of class II, and help clients switch to adjacent patterns. At some moment I became bored studying practical cases. It's a constant deja vu. Local circumstances are like ripples on water, but the waves that hit the lighthouse never change.",
        "This environment creates a tunnel vision of sorts in the heads of professionals. They live in the field of prey.",
        "Some even start to see reactive patterns of behavior as normal and desirable ones and claim proactive patterns to be traumatized and [irrational](/post/relative-irrationality). It's a limited picture of the world that can quietly poison the minds of all their clients.",
        "Psychology is supposed to be a field that studies the psyche as it is, but the more I learn about behavior-related schools and observe therapists, the more it looks like they tend to shape and force some censored understanding instead.",
        "Your clients don't represent the world in all its diversity. Be careful with generalizations. Convenience is not nature.",
        "The fox that steals from your farm is not sick."
    ]
}
