{
    "title": "Wrong tool for the job",
    "date": "2025-09-03",
    "tags": ["evolution", "psychology"],
    "thumb": "6f6a5f2115551bedfe5dd268d219d6eb",
    "content": [
        "One of the main tricks in my theory is breaking a pattern. It's a very straightforward action on its own, but it feels like there is one nuance that needs to be elaborated.",
        "Every pattern of behavior of class I includes impulses from three systems out of four. One is missing. When we're trying to stop some loop, it doesn't make much sense to appeal to something that is not connected to it.",
        "For example, patterns (1), (5), (9), (13). The first column of our table. They don't utilize intelligence. Individuals will not react to any logical reasoning. They won't stop just because you have good arguments. They may react to the changes in the environment, new temptations, or something that affects their will to live. But serious discussions are a waste of time.",
        "Chimp, turning aggressive because all females ignore him (1), can change his mind when he gets attention. Gladiator (5) may stop if he loses feedback. Don't feed the troll! You can even unbalance highly adaptive ones (9) by taking their ability to ignore things. You can change the environment, play with choices against something, or even use blind force, but have you ever tried to reason with any of these characters? It's hard. It just doesn't work. It's the wrong tool for the job.",
        "The loops in the second column, (2), (6), (10), (14), don't utilize free will. If you tell these individuals that they can just try something new, they'll not listen. They're not ready to explore possibilities and make big decisions on their own. Adapt. They use their brains. You can make an argument. Just don't suggest them jump off the cliff right from the beginning. Start small.",
        "The third column, (3), (7), (11), (15), is not connected to will to live. These ones will not care about the risks in the long run. The last column, (4), (8), (12), (16), is not connected to the environment. You'll not stop these loops by changing external circumstances. Every column has one thing that is not there. Interact with the others.",
        "To guide behavior, we stop one pattern and help to use another one. All these thoughts can be applied to it as well. Don't waste resources on supporting something that's not connected to the desired pattern. Be efficient. Concentrate on one thing and push it to the end.",
        "In many approaches in psychology, one trick is being used for everything. But this is not the case. Every column has its unique features. Every pattern is different. You have to be intentional and precise. The table can be used as a cheat sheet. It should help."
    ]
}
