{
    "title": "Updating memory",
    "date": "2025-09-04",
    "tags": ["evolution", "psychology", "memory", "emotions"],
    "thumb": "c7eb0a18085976d703464bcf41aa5cb0",
    "content": [
        "What happens when you update data in your memory? It's a complex process. It takes some time, and there are distinct stages in it that can be important for us. Let's take a look.",
        "First. You got a new piece of data. It's in your system, but it's not yet connected to anything in the main graph of memories. Updates in the real world are not instant. There is some lag to expect. In many cases you have to proceed with your tasks with slightly outdated information. Psychologists will call this \"denial\". You have data, but you don't use it.",
        "Second. The process of updating has started. Now you have conflicts in memory. Some new connections were added. Some old data is still there. It's a mess. Usually, in computer systems, we avoid any actions at this stage. Operations with partially updated memory tend to destabilize everything. It's safer to stop and wait. In terms of psychologists, it's like a state of \"bargaining\". There are potential conflicts inside.",
        "Third, the process finished. Your memory is up-to-date. You're good to go. This is what you would probably call \"acceptance\".",
        "These three stages of the process are absolutely inevitable. Every heartless machine has them. But your system, depending on its design, may or may not have additional signals for self-diagnosing and internal synchronization.",
        "Before the first stage, you may get a signal from your inputs that the update is required. It's a kick-starter. A flash. It doesn't last long. We may call this a \"surprise\", \"shock\", or whatever word feels more suitable for the circumstances.",
        "Before the second stage, you already have the data, and you may evaluate the resources required for the update and further actions. At this point you may get a bunch of signals all over the system that order the parts of it to redirect energy. A lot of things happen simultaneously. Priorities change. Some subsystems lose resources. We may call this \"frustration\".",
        "Before the third stage, you may diagnose the system again to see how much resources you've spent and what's left. You may need this data to plan your further survival. In human terms it's either \"relief\", or \"tiredness\", or something like that.",
        "Psychologists often describe the stages of grief in a similar fashion. The main issue is that they tell you what we see, but not what happens. In the result, you can get various poetic word plays that are very hard to test. But when you look from the inside, you see the inevitable parts of the process. And they're not about your feelings, really. Every one of them has a purely engineering reason to be there."
    ]
}
