{
    "title": "To eat, or not to eat?",
    "date": "2025-08-01",
    "tags": ["evolution", "methodology"],
    "thumb": "6758e99a2d2992dbcb0a331d1ecaeddb",
    "content": [
        "To eat, or not to eat? That is the question. Or not. Not really, isn't it? The law of conservation of energy suggests that you cannot get energy from nothing, which means that every organism has to include an energy conversion subsystem in it. Every human has to eat. Every mammal. Every living thing. Every alien. Every robot. Every zombie. Everybody. The ways of converting energy can be different, but the process itself has to be there.",
        "In the context of behavior, we have lots of subsystems and actions to keep in mind. It's overwhelming. However, most of them are universal. They're everywhere. Sometimes they're absolutely necessary for every system in our field. Sometimes they're specific for different species, but every individual in the species does the same thing. We can subtract them from every part of the equation. It allows us to concentrate on the things that actually make the difference.",
        "This is the reason why I don't include some systems and actions in my work. They're not specific enough. Right now I'm mapping the data from my theory to the human brain, and it looks like the reward system is everywhere. It works in the same way in every pattern of behavior. It cannot explain any choices. It seems to not be connected to any disease in my list. It's just there. Like a universal artifact of human biology. Should we exclude it from the equations? I'm not sure. Probably.",
        "I would argue that even such an important phenomenon as qualia can be completely irrelevant to the psychology of behavior, because it's all about choices, and the qualia, as we understand it, is a universal artifact.",
        "It would be interesting to notice that all these things are not really under our subjective control. We don't control our hunger and digestion. We cannot choose to not have qualia.",
        "In some cases we can disrupt these universal subsystems and processes. This leads to the diseases that we normally treat as non-psychiatric. They can make you less efficient in whatever you do, or completely prevent you from doing things, but you'll not end up in a nuthouse.",
        "This leads me to thinking that in order to speed things up in the field of psychiatry, we can not only pay more [attention to the inevitable](/post/is-there-any-other-way), but we can cut. We can cut everything that seems to be everywhere. Mercilessly. Cut. Cut. Cut. There are many things in our brains, but only a small amount of them have something to do with choices and psychiatric diseases. Most of them are just there. It's hard to put away something that you have invested in, but maybe it's time."
    ]
}
