{
    "title": "Where it lands?",
    "date": "2025-08-21",
    "tags": ["evolution", "methodology", "language"],
    "thumb": "ff3635c108c08f145cdcfe66b87108e6",
    "content": [
        "The existence of the basic impulses from [my theory](/post/the-evolutionary-theory-of-behavior) should be obvious for every person who ever looked at the real people outside. The four parts of the psyche are more of a game of language, rather than a game of logic. They're there to create the right mindset. To show that there are four functional roles to begin with. However, when we [connect everything](/images/4d198819ade3176ccd510089e6b2c4e4.jpg), it may not be obvious why the processes end where they end. Why don't we reconnect them in a different fashion?",
        "The thing is, the processes start exactly where we placed them, according to their roles, but they end where they have to. It may sound counterintuitive, but they just don't have any options here. It feels like everything should be connected to everything, but every process has its requirements. Their directions are already incorporated in their meanings.",
        "We need the environment to ignore it. We need somebody out there to call for help. We need to find the supplies in order to exhaust them. We need space to create new things in it. We need the world of things to annihilate them in various ways. Every process here requires an environment. We can make compromises in some other things, but not here.",
        "Temptation to violate the rules, as well as justification, bending the rules, requires intelligence. We need to work with rules to do these things. Diagnosing and dread require us to operate with rules and consequences. To understand that the environment gives us things we don't deserve, or stops our actions, we have to work with logical rules as well. Every road leads us to the same intelligence. These processes won't work without it.",
        "The helping environment gives us free energy for new unnecessary actions, while danger suggests us to change our course. Counterbalance, protection, and reconstruction are the ways to go against the naturally happening events. Inaction is a change in some indefinitely working program. Everything here pushed us to other ways of doing things. Again, the processes start differently, but they lead to the same place.",
        "Adaptation and goal-oriented destruction are two sides of the same blade, pointed in opposite directions. Both can hurt us. Inflexibility leads to conflicts. Indifferent environment means that there is something wrong. These impulses trigger the self-preservation mechanism. The rest of them are on the other side of the coin. They are notifications that there is a pause in action. It's time to heal and recover. The destination is the same.",
        "We will need to perform some adjustments eventually, polish the wordings to make everything sound better, and grasp the right meanings. Nobody invented all these words to be used in this sort of system. It's a hard linguistic problem, and even the detailed descriptions in the book are not silver bullets, but I hope this explanation will help others to improve this system or build similar models for different processes. Just throw an apple and look where it lands naturally. It shouldn't have a choice."
    ]
}
