{
    "title": "Hidden knowledge",
    "date": "2025-08-28",
    "tags": ["evolution", "religion", "language", "methodology"],
    "thumb": "d6ad4caada75bff616b26ba11d2d78af",
    "content": [
        "Religious texts are often full of metaphors and oversimplified for the sake of a good story. It's ok. Literature is an art. But these books include insane amounts of information about human psychology. I'll give you a few examples.",
        "Structural parts of the psyche. The id, ego, and superego that we know from psychoanalysis. Actually, they've been with us for millennia. Socrates used to talk about them. Shoulder angel and shoulder devil. Order and chaos. Preservation and change. Will to live and free will. Two forces. Two wills. Two whispering creatures. And \"you\", stuck in the middle.",
        "Sensory rooms to help people with psychological problems were invented in the 70s, but you can trace them back at least to the time of witch hunts. Most likely they were with us much longer. I'm just not motivated enough to find the origins.",
        "Art therapy? The idea that warriors can neutralize their destructive mindsets by making art when going home to family is not new. Many old pagan rituals look exactly like combinations of art therapy with gestalt therapy. We don't call them like that, but the working principles are identical.",
        "Modern therapists use the same tricks that men of religion used for centuries. They deny this, of course, to look more serious, which is funny, but it's kind of true. And no, I'm not here to criticize. I'm here to whisper.",
        "The knowledge is there. In the books. Our ancestors collected some data for us. We can use it. We just need to translate everything into the modern language of science. Don't make conflicts between science and religion. Make translations. Poets and scholars look at the same world at the end.",
        "In physics, we've made a lot of progress in the last few centuries. When everybody around us is getting magical skin burns, we borrow a Geiger counter from radiology and check everything. We don't blame the invisible evil anymore. Old stories are like outdated theories now. Good enough for a cave man, but not to get the GPS on your phone working. We have better stories now, with more precision.",
        "But in psychology, we still exist on the level of protoscience. We live in the cave. We need to build a stable basement for the field. In our position, it's not wise to discard data just because the authors don't have a PhD.",
        "Read old books. Listen to folks out there. Test their claims. Combine old approaches with [fresh observations](/post/the-abyss). Utilize every bit of knowledge we have. It doesn't guarantee success, but it's better than reinventing everything on your own."
    ]
}
