{
    "title": "Internal world",
    "date": "2025-09-27",
    "tags": ["evolution", "memory", "intelligence"],
    "thumb": "87738bfb69ba7f43a1deb4953f07c924",
    "content": [
        "Let's say you have some basic consciousness. You save and extract data from your memory. What's next? How to evolve? Try to mix things. Associate sequences of data if they come together.",
        "Now compare some sequences. Are they identical? Similar? You don't understand anything at this moment, but you can make a rule. A to B. Once you receive a sequence A, find that rule and proceed to B.",
        "Do you have any free will in your pockets? Use it. Override your instructions for behavior with new rules. You can create rules and follow them. You got a tiny bit of intelligence. Congratulations! You're a genius bacteria! It's time to [increase your cache](/post/the-magical-number-6) and play with more complex relations.",
        "Take three sequences. A. B. S. If A = S, and B = S, then A = B. You just learned Euclidean relations. Great. Try to work with parts. If A includes S1 and S2, and B includes S1 and S2, then A = B. We're getting somewhere. Try to compare a lot of sequences. Find a pattern.",
        "A = B = C = D = E... = S1 + S2 + X.",
        "What is this? It's a symbol. How do you call it? You don't. You don't speak any languages yet. But you can save it. You can play with sequences of data that exist only in your head, finding patterns in patterns, and creating a symbolic world.",
        "Patterns and symbols are cool, but you may want to learn fuzzy transitivity as well. If you have a sequence S, it's connected to A, and A to B, then S is connected to B.",
        "Now you can see a destination of a sequence. Reuse skills with various subjects in a symbolic group. Play with associations. You can build a lot of things, even a fancy conflict-resolving module for your rules, where you wander around the memory graph and find alternative rules for some tricky situation.",
        "We may be from different species, but we exist in the same environment and have similar sensors. We likely receive similar sequences of data. We find more or less the same patterns and save them as symbols. This is our collective unconscious. By using it, we align our actions even if we don't know each other and don't have any common language.",
        "Oh, right. We'll need a language. Our internal worlds may be relatively unique, but we associate sequences that come together. One day we'll find a common sequence. A word. An adapter between one of my sequences and one of yours. We can make a conversation now.",
        "Do you monitor some of your data channels? Yes? So you have a live feed of your... thoughts? You [observe](/post/selfie) sequences of data? Feel symbolic connections? And even say the words of our language somewhere inside?",
        "Wow!",
        "It's quite a mind you have!"
    ]
}
