{
    "title": "Trauma",
    "date": "2025-08-29",
    "tags": ["evolution", "psychology"],
    "thumb": "210bb57f855dd5637bd941f570bad0a0",
    "content": [
        "Psychologists like the word \"trauma\". But the definitions are very vague. Maybe we should take a look at the potential problems and help this term mean something more specific.",
        "First. [Cognitive dissonance](/post/make-it-black). I would argue that it's not a trauma at all. It's a natural process. Nothing is broken. You just need to grab a coffee and wait for your memory to update the data. It's a temporary inconvenience.",
        "Second. Diseases. Mania. Depression. Catatonia. Schizophrenia. They lead us to internal logical conflicts. There are serious [breakdowns in the system](/post/the-evolutionary-theory-of-behavior). The same applies to anxiety with exaggerated impulses and other diseases. You can't fix rusty valves and leaking tubes by talking about your childhood. I mean, you can ignore the leak, but it's not a real solution.",
        "Third. Memory about the dangerous environment that pushes you into the patterns (9) or (15). Adapt and ignore, or justify and call for pity. Or both, as a pattern of the class II. This is what I prefer to classify as trauma. It's not just memory. It affects your behavior. And it's not a disease.",
        "These two patterns are natural ways to behave for prey animals, but some educated and emotional people may not agree. High levels of stress hormones. You miss something. Grass is greener on the other side. You know the drill. But this problem can be solved. You can switch to other patterns. The real danger is in running from a bear through a minefield.",
        "Let's say you are an adaptive victim (9) + (15). Danger is everywhere. You work on self-awareness and you convince yourself that everything is safe now. Welcome to the pair (10) + (15). Helpless victim. Now you have dread on top of your trauma. Oops. And this pattern is a very confusing one. It's not a broken switch of depression, but an odd combination of danger and safety in an ocean of tears. Not the best choice.",
        "Maybe, you're a real man. You decide to stop crying. Then you can slip into (9) + (16). Adaptive conformist. Same problem with dread. Your stress hormones won't get lower. Wait. What?",
        "You can be stuck in this maze for a while, actually. Our chemistry is very inert. It will help you to switch between these patterns back and forth. It's hard to find an exit. Plus, in terms of energy, it's efficient to stick to one pattern. Changes of directions can exhaust you on their own.",
        "If you want to get out, you need to choose the patterns (11), (12), (13), or (14), or change the side completely and become a proactive predator. Their patterns are based on a different chemistry. But this choice is not for everyone. There will be [consequences](/post/relative-irrationality)."
    ]
}
