{
    "title": "The abyss",
    "date": "2025-07-17",
    "tags": ["evolution", "methodology"],
    "thumb": "b34b6df311471d9400e88ca902077118",
    "content": [
        "Usually, when psychologists talk about the internet and social networks, they ask questions about the changes in our lives. How do all these technologies affect our relationships? How do they affect our IQ? Mental health? Whatever. There are many questions to ask, lots of things to worry about. But there is another side of this coin that seems to be underrepresented in discussions:",
        "How do social networks change the science itself?",
        "Psychologists are whining about a crisis in the field for decades now. No good theories. No good models. Old ones fall apart. We'll never understand the mind. It's way too complex. But. What do you need to make a good model of something? You need data. Good quality data. With all sorts of edge cases, rare cases, exceptions, etc. You need to know what can happen. Even if it happens once in a billion. You don't need statistics. You need proof of existence.",
        "A century ago people were spending their whole lives looking for those rare cases. It's hard work. Most old theories were based on very limited datasets. They just don't cover the whole variety of possible behaviors. But these days, with all our technologies, we can collect everything we need to build good models. We just need our computers and a stable internet connection. People all around the world have smartphones with cameras. They film everything for us. Especially if something looks unusual, we can be sure that somebody will film it and post it online to get likes and subscribers.",
        "Do you know that a dog and a goose can be friends? Monkeys use plants as medicine? Ants farm other insects? There are videos out there, waiting to be studied.",
        "And people... Oh. They do all sorts of things as well. Beautiful. Odd. Terrifying. You can see everything now. If you're not afraid to gaze into the abyss, of course.",
        "We have videos of all sorts of behaviors of humans and animals in their natural habitats. Pure. Raw. No rules. No limits. We have uncensored materials with the people from the darkest criminal corners of society. We have bloggers in the war zones. We have diaries of patients with various psychiatric diseases, who share their first-hand experiences. We have interviews with chiefs of the remote tribes who still live in the Stone Age. All sorts of cultures, religions, professions. Everything. All this data just waits for us there. Social networks became the literal heaven for psychologists.",
        "It's time to stop whining. Go create something."
    ]
}
