{
    "title": "Free will and moral responsibility",
    "date": "2025-07-12",
    "tags": ["evolution", "philosophy", "free_will", "morality"],
    "thumb": "ebf2df10390026a78411760257509774",
    "content": [
        "When we talk about moral responsibility, we usually mean that somebody has two options. He can either follow the rules of the group, or rebel against them. The judgement comes from the chosen path.",
        "Different groups will have different rules. We expect that. It will not be a big problem, as long as you stay with just one group. But there is a much deeper question here.",
        "Let's say we have a group with some rules and an individual on his own. In order to join, to follow the new moral rules of the group, he needs to have free will. He has to rewire his existing instructions for behavior. To rebel against his past. This is what the group members will expect him to do. To leave the past behind and become one of their own. To become a good person. But once he's there, they will want him to stop. He has to follow their rules and do not change his path ever again. Apparently, it's morally wrong to rebel the second time. He will become a traitor. A sinner.",
        "This creates a brainwashing paradox of moral responsibility. You need to have free will to join the group of moralists, but you need to lose free will to stay in it. Otherwise you will be constantly bullied by other members of the group for thinking alternative thoughts, asking unwanted questions, and considering actions against their moral rules in general.",
        "Not every group has this sort of moral pressure, of course. Some groups are open to changes. They are ready to let their members go. However, some groups are almost obsessed with their rules and stability.",
        "In my theory, I proposed that this loss of free will, loss of the ability to change, is not a good thing. It's a sickness. It's a psychiatric disease that we haven't discovered yet. And these are not just thoughts out of nowhere. I saw some groups of people who do not just judge others all day long, but they repeat each other a lot. They repeat long sentences word by word. They repeat everyday actions. They literally cannot sustain a conversation about anything new. They seem to lose the ability to learn things. The longer you look, the more you see. At some moment it starts to feel like they're not human. It's kind of a creepy thing to observe, actually.",
        "My point here is that the relations between moral responsibility and free will seem to be complicated. I even start to think that we don't treat the lack of free will as a separate disease just because a lot of societies in our world want to see their members not have it. They're being constantly told that it is morally good to follow the flow and be happy."
    ]
}
