{
    "title": "Practical observations",
    "date": "2025-05-26",
    "tags": ["psychology", "evolution"],
    "thumb": "e9442e1b2a14dd8a7b950f3444dc7870",
    "content": [
        "I put an accent on this in the book, but it seems to be important to clarify a couple of moments, related to the practical observations. Just to make sure that we don't have any room for misinterpretations.",
        "The [evolutionary theory of behavior](/post/the-evolutionary-theory-of-behavior) is about actions. Thoughts, emotions, and the words that are being used to express them, mean nothing, until they become the real observable actions. Individuals that use the reactive patterns of behavior often overestimate their proactive abilities in conversations and vice versa. We need to pay the attention to the actions only.",
        "Also, results do not define approaches. If we give a relatively complex task with some degree of freedom, like having a lunch for example, to several individuals, then we will see the different approaches.",
        "Somebody gets ten burgers, two bottles of soda on top, and then lies on a sofa, too tired to do anything else. Somebody gets an egg, espresso, and calls it a day. Somebody creates all sorts of rules. I sit here. You sit there. Knife on the right side. Fork on the left. Some speech is required. Somebody gets a pig's head, puts an apple in its mouth, adds leaves and flowers, creating a piece of art and telling a story in the process. At the end, some food will be eaten in all scenarios. The results will be practically the same, but the approaches are completely different and correspond to the different patterns of behavior.",
        "In this context, it should be obvious that the profession does not define the behavior. Although some patterns would be more practical in some circumstances.",
        "In many psychological schools, things are constructed in reverse. The emotions come first, and the actions are just the final results. But in our system actions are everything."
    ]
}
