{
    "title": "Coordinate system",
    "date": "2025-09-15",
    "tags": ["evolution", "methodology", "philosophy", "free_will"],
    "thumb": "cced063e2155d599acd6315644e11e6f",
    "content": [
        "We suffer from a [99 languages problem](/post/99-languages). Let's take free will for instance. One word. But. Psychologists may say that you use it to change your life. Physicists say it's impossible. Politics say it exists, but we don't want you to have it. Priests argue about freedom from god and mortal sins. Philosophers... you know, philosophers. It's a kindergarten. Every boy says that he is the real man and knows the truth.",
        "In every field people look at the same universe. They just have different coordinate systems. We should be able to use geometric transformations to move all data into one system.",
        "It's not just a simple linguistic translation word to word, but a projection, system to system. We can keep most of the relationships between data points and make a coherent picture using data from several fields simultaneously.",
        "All coordinate systems should be interchangeable in our context. We can make a choice using our aesthetic preferences alone, but some options will be more convenient in practice.",
        "For example, in physics, we have an axis from determinism towards randomness. It's hard to work with it. Data tends to be stretched between two extremes. It's either \"pretty sure it's determined\" or \"pretty sure it's not\". Our computers don't have enough precision to work with things in between.",
        "It looks like you need free will to get away from determinism, but then you are immediately thrown into randomness. We can't work efficiently with complex models of reality in the middle.",
        "If we get some inspiration from pagans, we may choose another axis, from order to chaos. It's similar, but it's not the same one. Data appears on our screens in a different shape.",
        "You need the same free will to get away from order, but instead of two extremes we clearly see a spectrum. Some things can be more structured or more chaotic. We can work with that.",
        "Wills look like proper forces now. They push you along the axis, free will in one direction and will to live in the opposite one. We see how they [affect our society](/post/path-of-order), how do you use them to [make choices](/post/make-a-choice), how do you [actually build them](/post/architect-mindset), why people may [see them differently](/post/freedom), etc. Everything suddenly works. We can compare our notes and make new theories.",
        "Of course, every boy in the kindergarten will say that this is not the real free will and chaos is not true randomness. Exactly! That's the whole point. This approach is a cosmic compromise. It moves everything in one place and helps to see the big picture. We need it to build new things. Then you can project data back to your home field and use it in the \"right\" way."
    ]
}
