{
    "title": "99 languages",
    "date": "2025-08-12",
    "tags": ["evolution", "philosophy", "language"],
    "thumb": "c8bc6a035bc2392c496fa728d306e2c5",
    "content": [
        "Mistakes. We make them. Even my lecture notes include some. Apparently, my proofreaders from the IT world with their fancy AI spell checkers are way too tolerant. They're just some spelling bugs. They're annoying. They buzz in your ears. But they do not damage the system itself in any way. We can fix them, or even ignore them, and try to not repeat them ever again. As time goes on, we learn our lessons. The process is straightforward. Learn more rules. Make fewer mistakes.",
        "Everything works fine. Until it doesn't. It turns out, there are different rules for the same language in different fields. You cannot follow all of them. They contradict each other.",
        "And I'm not talking about all those complex writing styles that many scientists use for some reason. No. They're easy to balance. Just keep it simple. I'm talking about the words themselves. Sometimes the same word has completely different meanings in different contexts. Sometimes different terms are being used to describe the same thing, hiding the obvious. How do you deal with that?",
        "You can create a new set of terms for your project. Others will have to learn everything from scratch. It's hard. You can borrow some meanings from one field and force them into some other fields. This creates confusion. No matter what you choose, it's not perfect.",
        "My current project combines philosophy, psychology, psychiatry, sociology, programming, engineering, and now, at the second stage, it also gets biology, neuroscience, and some general physics involved. It's a linguistic mess that haunts the project from the very beginning.",
        "The philosophical introduction to my theory explains the most important terms. It helps, but it's not enough. There is a whole bunch of IT-related concepts that are obvious to me and my colleagues, but not to some average psychologist or biologist. They use the same words with completely different meanings and everything falls apart in their heads. It starts to look like I need to make a second edition of my notes with ten pages of translations and explanations for every single page of actual theory. It doesn't feel right.",
        "The academic community seems to avoid this problem, but it's big. We cannot see invariants clearly when the rules of language are messed up. Sometimes scholars spend years to rediscover common knowledge just because they cannot see it in front of them. It's really hard to reuse knowledge, unless you create your own symbolic language to fix the inconsistencies between the fields, but then nobody understands you.",
        "What should we do? Is it time to stop fragmenting the science and create a universal language, like we do in large companies, to synchronize their business and IT departments?"
    ]
}
