{
    "title": "Is there any other way?",
    "date": "2025-07-06",
    "tags": ["evolution", "methodology"],
    "thumb": "73bb3d0913b06d6694a208a25416d270",
    "pinned": "true",
    "content": [
        "Evolution is all about the increasing complexity of the systems. How do we increase complexity? We combine things. And mutate them. Combine. Mutate. Combine. Mutate. Combine. Mutate. Etc.",
        "There is a confusing saying, \"evolution by natural selection\". It sounds almost like \"complexity increases because of destruction\". It does not. It increases because of combinations and mutations. Destruction can create the alternative paths to follow within the tree of combinations, but it does not create the combinations themselves.",
        "If we imagine the world without destruction, the architect's playground, and we wait for eons, we will see all the possible systems being created. But. Not everything can be created within the universe. There are limits. There are rules. There is a natural order. We cannot deny physics.",
        "This means not only that some things cannot be technically constructed, but also that some existing systems can have only one possible architecture. When we study a complex system that we don't understand, we can ask an important question: how to design this thing, and is there any other way to do that?",
        "We can dive into a black-box penetration testing of sorts. We collect data from inputs and outputs of the system, we learn about the limitations, we make educated guesses on how it is being constructed inside, and then we crack it. This approach can be applied to the psyche of the living organisms, not only to the IT systems. Although I expect that some psychologists would say that this idea is borderline insane.",
        "Let's say we observe some behavior. What parts and processes are the necessary ingredients to build it? Are there many ways to build it? Or maybe not? Some things cannot happen simultaneously. Some things require other things. Some things have inevitable consequences. We may have different brain chemistry, different environments, different ways to convert energy, but these are ripples on the water. The options in the very core of the psyche are limited.",
        "I believe that understanding the inevitable parts of the tree of combinations, the universal modules and processes in the psyche, that do not depend on anything except basic physics and logic, is the way to resolve the current theory crisis in psychology."
    ]
}
