{
    "title": "The ghost within",
    "date": "2025-09-07",
    "tags": ["evolution", "psychology", "memory"],
    "thumb": "89e782e408643e919b39a28cb78805eb",
    "content": [
        "The concept of inner child is one of the mysteries of psychology. It's there, but you can't measure it. It affects you, but maybe not. You can interact with it, but not shoot it dead. It's not a child, but a ghost of a child.",
        "From our perspective, there is only one object that fits the profile. A part of the memory graph that was constructed relatively long ago and includes at least one rule.",
        "The main problem here is that the rule itself and the data that was a reason to create it are two separate things. If you delete the rule and keep the data, it's not a problem, but if you lose the data, but keep the rule, then you get yourself a ghost rule. A rule with no reason to be there.",
        "People who use the same patterns of behavior for their whole lives may never think about these things. You ain't need no inner child to be a man! It's because all their rules point them more or less in the same direction.",
        "Some people may want to switch to another pattern. It's not a problem, but you need to update the rules. Some of them are universal. Language. Basic skills. Profession. But some rules may be connected to a specific pattern that you've used before. It's time to delete them.",
        "But if some rule doesn't have a reason to exist anymore, it would be hard to evaluate how important the rule is. For some it will feel safer to keep it intact. This is the way to get stuck between patterns, not using your full potential with the new ones.",
        "Usually, the concept of inner child comes into play in relation to [trauma](/post/trauma), but it looks like the trauma is a special case. Old rules exist in your memory regardless of your patterns. Clients in therapy will never cover the whole variety of possible behaviors, but it should be obvious that one becomes a prey only because there are predators out there. They may have rules, not related to traumas, but the same conflict inside.",
        "The most popular way to deal with ghosts from the past in folklore is giving them what they want. Apparently, this is the technique of choice for many therapists these days. Take your inner child and fulfill his needs. No, it's not magic!",
        "It kind of works. But you have to be careful. Your goal is to destroy what's left of the old pattern. Not to encourage it. Be not afraid to burn things. There is no such thing as \"true self\" to lose here. There are old rules and new rules. If you got two incompatible rules, you just choose one and stick with it. This is who you are. For now. One day you'll become a ghost yourself and will haunt the future you."
    ]
}
