{
    "title": "Freedom",
    "date": "2025-06-01",
    "tags": ["evolution", "philosophy", "religion", "free_will"],
    "thumb": "bd85f0d1818cc1ef812041c3c70070fd",
    "content": [
        "Free will. I use it in my work. Never questioned it. But it seems like in the western philosophy people talk a lot about determinism. They have arguments against freedom. So I asked myself, why our ideas look so different?",
        "During my childhood, I got two perspectives, two ways of seeing the freedom. One from the Eastern Orthodox Church, and another one from the local pagans and occultists.",
        "Pagans believe in chaos. We come from it. We return to it. It is home. It is freedom. The absolute freedom. And even when we stuck in the limited material body, we still carry a piece of chaos inside. This is our nature. This is who we are. By embracing the chaos, we get the freedom to do anything. To change the world. I like this position. There is something in it.",
        "Christians believe in the same chaos, but they associate it with sins. They agree that we all have it inside, but they say it's dangerous. It's like a spiritual sickness. It makes you do stupid things. You'll get hurt by following it. This is not the kind of freedom, that would be wise to have. They talk about the self-preservation a lot, actually. They give you a list of things that you're supposed to do to survive and protect your kin. They may call it a God's will. The right way to be. Whatever. They appreciate, when you exercise your will, and work hard according to these rules.",
        "Both parties agree, that we do include some chaos inside us, some freedom to do things, but they have different opinions on what we should do with it. Some say we should embrace the chaos and do things just because we can, and some say we should work to control it, and preserve ourselves. This duality stuck very deep in my head, and, apparently, it got reflected in my work.",
        "In the English-speaking world, at least in the debates on YouTube and Reddit, people are greatly influenced by  Protestantism. They talk a lot about the faith, grace, and divine things, that generally happen on their own. They don't really talk about the chaos, and they don't talk about your personal actions that make the difference. You just need to have faith and the universe will take care of everything else. Psychological determinism fits quite naturally in this cultural environment. Things had been set for you already. You will not change anything. Freedom is an illusion.",
        "I won't make any conclusions here. We don't have enough data to completely prove determinism, or to prove it wrong. These are just some thoughts on the cultural differences that may affect the behavior and our philosophical views."
    ]
}
