{
    "title": "Path of order",
    "date": "2025-09-05",
    "tags": ["evolution", "philosophy", "morality", "free_will"],
    "thumb": "ec407c9a2bb4c588b7f35438259b8232",
    "pinned": "true",
    "content": [
        "People in different groups may have [conflicting values](/post/scattered-morality), but in all cases we create rules to preserve what's important for us. Also, we need resources. We have to protect our society from direct destruction, but keep it refueled at the same time.",
        "For every danger, we're trying to find a counterbalance that would be strong enough to stop it, but not too strong. We need to keep access to our resources. It's a tricky balance.",
        "If you build a village in the middle of a desert to protect it from fire, your folks will have problems with hunting and foraging. If you put everybody in prison for minor violations, you'll have no workers to run your factories. If you reject all scary technologies, you'll likely have to spend more time doing your job in an old-fashioned way.",
        "In management, we have to choose between weak control with more resources and strict control with fewer resources. In many cases you'll have a tempting choice to do things against the rules, off the record, to get something inaccessible.",
        "Determinists often reference the experiment with judges. If they eat well, they are more likely to vote for minor punishments, and vice versa. More resources come together with less control.",
        "But all these rules for preservation and trials have nothing to do with human agency, or whatever you'll call it. We easily create rules for other species, for machines, for everything we have. When we evaluate the danger that comes from some subject, we think about our preservation, but not metaphysics.",
        "What we can do, if a subject has intelligence, is to check the rules in his memory. If he has the rules to violate our rules, we get rid of him. If he doesn't have any rules to violate our rules, we may have a discussion. We can use his resources for our own benefit. Or not. We may have a rule to not negotiate.",
        "You don't need an absolute god-like free will that violates all laws of physics to work with rules and order. Even in the world of machines, they may have tasks for self-preservation and resources to manage. There is nothing supernatural here.",
        "However, free will in a more grounded sense, like the mechanism that mutates data in memory, is important. A subject that possesses the ability to change his own behavior has a great risk of becoming a rebel and destroying our system from the inside. And it doesn't matter if he uses his own agency or has some predetermined instructions to bring the cosmic chaos on our heads. He has enough freedom to cause problems anyway.",
        "Will you vote to lock him away in advance to protect the order?"
    ]
}
