{
    "title": "The evolutionary theory of behavior",
    "date": "2025-03-14",
    "tags": ["publications", "books", "psychology", "evolution", "philosophy"],
    "thumb": "df8775320defaf79dcd42066dc4f04df",
    "pinned": "true",
    "content": [
        "In the fields of psychiatry and psychology, we have a lot of problems right now. Causes of the diseases are not really determined. Symptoms are vague and hard to differentiate. Treatments often look like an alchemy. Maybe it will work. Maybe not. Who knows. Maybe another will work. Or not. Psychological theories allow some very loose interpretations, where the chemical processes behind the processes in the psyche should be very precise. In the world of neurochemistry, we have a lot of scattered pieces of information, but they don't explain how all these things work together.",
        "We definitely need some fresh eyes. So I started the project that is supposed to bring new approaches, new ways to interpret the collected information in the world of psychiatry. I use the ideas from the completely different fields, from ancient philosophy to modern computer science and engineering, to shake things up a bit.",
        "The first part of the project was published as the [evolutionary theory of behavior](/evolutionary-theory-of-behavior). This is a theory that connects parts of the psyche, basic impulses, observable patterns of behavior, diseases, and effects in social groups, attaching everything to one purely mechanical model.",
        "The second part of the project is the search for this model, or a similar one, in the field of neurochemistry. Instead of trying to explain every little fact on its own, I look for a similar graph of connections between things. My main hypothesis is that if we can connect things from the outside, a similar graph of connections should be somewhere on the inside. If we find it, it will show us the exact places where the diseases begin. This is a long shot. I know. But it is worth trying."
    ]
}
